ubiubiubi/iwasz-sandbox/tm4c123-drama-button-v2/src/main.c
/****************************************************************************
 *                                                                          *
 *  Author : lukasz.iwaszkiewicz@gmail.com                                  *
 *  ~~~~~~~~                                                                *
 *  License : see COPYING file for details.                                 *
 *  ~~~~~~~~~                                                               *
 ****************************************************************************/

#include <stdint.h>
#include <stdbool.h>
#include <stdio.h>
#include "inc/tm4c123gh6pm.h"
#include "driverlib/sysctl.h"
#include "driverlib/gpio.h"
#include "driverlib/usb.h"
#include "inc/hw_memmap.h"
#include "inc/hw_types.h"
#include "inc/hw_gpio.h"
#include "inc/hw_sysctl.h"
#include "usblib/usblib.h"
#include "usblib/usbhid.h"
#include "usblib/device/usbdevice.h"
#include "usblib/device/usbdhid.h"
#include "usblib/device/usbdhidkeyb.h"
#include "hidDescriptors.h"
#include "deviceDescriptors.h"
#include "driverlib/debug.h"
#include "buttons.h"
#include "rgb.h"
#include "callbacks.h"
#include "utils/uartstdio.h"
#include "driverlib/uart.h"
#include "driverlib/pin_map.h"
#include "rgb.h"

/*
 * https://www.microsoft.com/china/whdc/archive/w2kbd.mspx - here are instructions for HID keyboard design with additional miltimedia capabilities.
 * Microsoft reccomends that there should be a tleast two USB interfaces in suach a device. One should implement a oridinary keyboard compatible
 * with BOOT interface, so such keyboard would be operational during system startup, when there is no OS support yet, and another one would implement
 * the rest of desired keys such as play/pause, volume up, down and so on. I saw quite a few USB interface layouts onforming to this recommendations
 * over the net, including my own keyboard connected to my computer as I write this, so I assume this is the right way to do this.
 *
 * http://www.usblyzer.com/reports/usb-properties/usb-keyboard.html - this is an example of USB interface layout as mentioned earlier. HID reports are
 * also provided.
 */

#ifdef DEBUG
void __error__ (char *pcFilename, unsigned long ulLine)
{
        while (1) {

        }
}
#endif

#define VENDOR_ID 0x20a0
#define PRODUCT_ID 0x41ff
#define REPORT1_SIZE 8
#define REPORT2_SIZE 1

struct CallbackDTO {
        tDeviceInfo *deviceInfo;
        uint8_t report1[REPORT1_SIZE];
        uint8_t report2[REPORT2_SIZE];
        bool requestPending;
};

typedef struct CallbackDTO CallbackDTO;

/*##########################################################################*/

static const uint8_t deviceDescriptor[] =
{
    18,                         // Size of this structure.
    USB_DTYPE_DEVICE,           // Type of this structure.
    USBShort(0x110),            // USB version 1.1 (if we say 2.0, hosts assume
                                // high-speed - see USB 2.0 spec 9.2.6.6)
    USB_CLASS_DEVICE,           // USB Device Class
    0,                          // USB Device Sub-class
    USB_HID_PROTOCOL_NONE,      // USB Device protocol
    USBDHID_MAX_PACKET,         // Maximum packet size for default pipe.
    USBShort(VENDOR_ID),        // Vendor ID (VID).
    USBShort(PRODUCT_ID),       // Product ID (PID).
    USBShort(0x100),            // Device Version BCD.
    1,                          // Manufacturer string identifier.
    2,                          // Product string identifier.
    3,                          // Product serial number.
    1                           // Number of configurations.
};

//*****************************************************************************
//
// HID device configuration descriptor.
//
// It is vital that the configuration descriptor bConfigurationValue field
// (byte 6) is 1 for the first configuration and increments by 1 for each
// additional configuration defined here.  This relationship is assumed in the
// device stack for simplicity even though the USB 2.0 specification imposes
// no such restriction on the bConfigurationValue values.
//
// Note that this structure is deliberately located in RAM since we need to
// be able to patch some values in it based on client requirements.
//
//*****************************************************************************
static uint8_t configurationDescriptor[] =
{
    //
    // Configuration descriptor header.
    //
    9,                          // Size of the configuration descriptor.
    USB_DTYPE_CONFIGURATION,    // Type of this descriptor.
    USBShort(34),               // The total size of this full structure.
    2,                          // The number of interfaces in this configuration.
    1,                          // The unique value for this configuration.
    5,                          // The string identifier that describes this configuration.
    USB_CONF_ATTR_BUS_PWR,     // Bus Powered, Self Powered, remote wake up.
    125,                        // The maximum power in 2mA increments.
};

/**
 * Report descriptor. Standard BOOT protocol keyboard
 */
const uint8_t reportDescriptor1[]=
{
        UsagePage(USB_HID_GENERIC_DESKTOP),
        Usage(USB_HID_KEYBOARD),
        Collection(USB_HID_APPLICATION),
                //
                // Modifier keys.
                // 8 - 1 bit values indicating the modifier keys (ctrl, shift...)
                //
                ReportSize(1),
                ReportCount(8),
                UsagePage(USB_HID_USAGE_KEYCODES),
                UsageMinimum(224),
                UsageMaximum(231),
                LogicalMinimum(0),
                LogicalMaximum(1),
                Input(USB_HID_INPUT_DATA | USB_HID_INPUT_VARIABLE | USB_HID_INPUT_ABS),

                //
                // One byte of rsvd data required by HID spec.
                //
                ReportCount(1),
                ReportSize(8),
                Input(USB_HID_INPUT_CONSTANT),

                //
                // Keyboard LEDs.
                // 5 - 1 bit values.
                //
                ReportCount(5),
                ReportSize(1),
                UsagePage(USB_HID_USAGE_LEDS),
                UsageMinimum(1),
                UsageMaximum(5),
                Output(USB_HID_OUTPUT_DATA | USB_HID_OUTPUT_VARIABLE | USB_HID_OUTPUT_ABS),
                //
                // 1 - 3 bit value to pad out to a full byte.
                //
                ReportCount(1),
                ReportSize(3),
                Output(USB_HID_OUTPUT_CONSTANT), //LED report padding

                //
                // The Key buffer.
                // 6 - 8 bit values to store the current key state.
                //
                ReportCount(6),
                ReportSize(8),
                LogicalMinimum(0),
                LogicalMaximum(101),
                UsagePage(USB_HID_USAGE_KEYCODES),
                UsageMinimum (0),
                UsageMaximum (101),
                Input(USB_HID_INPUT_DATA | USB_HID_INPUT_ARRAY),
        EndCollection,
};

//*****************************************************************************
//
// The remainder of the configuration descriptor is stored in flash since we
// don't need to modify anything in it at runtime.
//
//*****************************************************************************
static const uint8_t interfaceDescriptor1[] =
{
    //
    // HID Device Class Interface Descriptor.
    //
    9,                          // Size of the interface descriptor.
    USB_DTYPE_INTERFACE,        // Type of this descriptor.
    0,                          // The index for this interface.
    0,                          // The alternate setting for this interface.
    1,                          // The number of endpoints used by this
                                // interface.
    USB_CLASS_HID,              // The interface class
    USB_HID_SCLASS_BOOT,        // The interface sub-class.
    USB_HID_PROTOCOL_KEYB,      // The interface protocol for the sub-class
                                // specified above.
    4                           // The string index for this interface.
};

static const uint8_t hidKeyboardDescriptor1[] =
{
        // HID Descriptor
        9, // bLength
        USB_HID_DTYPE_HID, // bDescriptorType
        USBShort(0x111), // bcdHID (version 1.11 compliant)
        0, // bCountryCode (not localized)
        1, // bNumDescriptors
        USB_HID_DTYPE_REPORT,
        // Report descriptor
        USBShort (sizeof (reportDescriptor1)) // Size of report descriptor
};

static const uint8_t inEndpointDescriptor1[HIDINENDPOINT_SIZE] =
{
    7,                          // The size of the endpoint descriptor.
    USB_DTYPE_ENDPOINT,         // Descriptor type is an endpoint.
    USB_EP_DESC_IN | USBEPToIndex(USB_EP_1),
    USB_EP_ATTR_INT,            // Endpoint is an interrupt endpoint.
    USBShort(USBFIFOSizeToBytes(USB_FIFO_SZ_64)),
                                // The maximum packet size.
    16,                         // The polling interval for this endpoint.
};


/**
 * Report descriptor. Keyboard with "multimedia" buttons.
 */
const uint8_t reportDescriptor2[]=
{
//                0x05, 0x0C, // Usage Page (Consumer Devices)
//                0x09, 0x01, // Usage (Consumer Control)
//                0xA1, 0x01, // Collection (Application)
//                0x05, 0x0C, // Usage Page (Consumer Devices)
//                0x15, 0x00, // Logical Minimum (0)
//                0x25, 0x01, // Logical Maximum (1)
//                0x75, 0x01, // Report Size (1)
//                0x95, 0x07, // Report Count (7)
//                0x09, 0xB5, // Usage (Scan Next Track)
//                0x09, 0xB6, // Usage (Scan Previous Track)
//                0x09, 0xB7, // Usage (Stop)
//                0x09, 0xCD, // Usage (Play / Pause)
//                0x09, 0xE2, // Usage (Mute)
//                0x09, 0xE9, // Usage (Volume Up)
//                0x09, 0xEA, // Usage (Volume Down)
//                0x81, 0x02, // Input (Data, Variable, Absolute)
//                0x95, 0x01, // Report Count (1)
//                0x81, 0x01, // Input (Constant)
//                0xC0 // End Collection

        // http://www.usblyzer.com/reports/usb-properties/usb-keyboard.html
        UsagePage(0x0C), // Usage Page (Consumer Devices)
        Usage(0x01),     // Usage (Consumer Control)
        Collection(USB_HID_APPLICATION),
                UsagePage(0x0C), // Usage Page (Consumer Devices)
                LogicalMinimum(0),
                LogicalMaximum(1),
                ReportSize(1),
                ReportCount(7),
                Usage (0xB5), // Usage (Scan Next Track)
                Usage (0xB6), // Usage (Scan Previous Track)
                Usage (0xB7), // Usage (Stop)
                Usage (0xcd), // Usage (Play / Pause)
                Usage (0xe2), // Usage (Mute)
                Usage (0xe9), // Usage (Volume Up)
                Usage (0xea), // Usage (Volume Down)
                Input (USB_HID_INPUT_DATA | USB_HID_INPUT_VARIABLE | USB_HID_INPUT_ABS),
                ReportCount(1),
                Input (USB_HID_INPUT_CONSTANT | USB_HID_INPUT_ARRAY | USB_HID_INPUT_ABS),
        EndCollection
};

/**
 *
 */
static const uint8_t interfaceDescriptor2[] =
{
    //
    // HID Device Class Interface Descriptor.
    //
    9,                          // Size of the interface descriptor.
    USB_DTYPE_INTERFACE,        // Type of this descriptor.
    1,                          // The index for this interface.
    0,                          // The alternate setting for this interface.
    1,                          // The number of endpoints used by this
                                // interface.
    USB_CLASS_HID,              // The interface class
    USB_HID_SCLASS_NONE,        // The interface sub-class.
    USB_HID_PROTOCOL_NONE,      // The interface protocol for the sub-class
                                // specified above.
    4,                          // The string index for this interface.
};

static const uint8_t hidKeyboardDescriptor2[] =
{
        // HID Descriptor
        9, // bLength
        USB_HID_DTYPE_HID, // bDescriptorType
        USBShort(0x111), // bcdHID (version 1.11 compliant)
        0, // bCountryCode (not localized)
        1, // bNumDescriptors
        USB_HID_DTYPE_REPORT,
        // Report descriptor
        USBShort (sizeof (reportDescriptor2)) // Size of report descriptor
};

