ubiubiubi/iwasz-sandbox/tm4c123-drama-button-v2/src/main.c
                        // Send the data via endpoint 0.
                        USBDCDSendDataEP0 (0, reportDescriptor1, sizeof(reportDescriptor1));
                }
                else if (psUSBRequest->wIndex == 1) {
                        ui32Size = sizeof(reportDescriptor2);

                        // If there is more data to send than the host requested then just send the requested amount of data.
                        if (ui32Size > psUSBRequest->wLength) {
                                ui32Size = psUSBRequest->wLength;
                        }

                        // Send the data via endpoint 0.
                        USBDCDSendDataEP0 (0, reportDescriptor2, sizeof(reportDescriptor2));
                }
            break;
        }

        //
        // This is a request for the HID descriptor (as found in the
        // configuration descriptor following the relevant interface).
        //
        case USB_HID_DTYPE_HID:
        {

                if (psUSBRequest->wIndex == 0) {
                        ui32Size = sizeof(hidKeyboardDescriptor1);

                        if (ui32Size > psUSBRequest->wLength) {
                                ui32Size = psUSBRequest->wLength;
                        }
                        USBDCDSendDataEP0 (0, hidKeyboardDescriptor1, ui32Size);
                }
                else if (psUSBRequest->wIndex == 1) {
                        ui32Size = sizeof(hidKeyboardDescriptor2);

                        if (ui32Size > psUSBRequest->wLength) {
                                ui32Size = psUSBRequest->wLength;
                        }
                        USBDCDSendDataEP0 (0, hidKeyboardDescriptor2, ui32Size);
                }
            break;
        }

        //
        // This was an unknown request so stall.
        //
        default:
        {
            USBDCDStallEP0(0);
            break;
        }
    }
}

//*****************************************************************************
//
// This function is called by the USB device stack whenever a non-standard
// request is received.
//
// \param pvHIDInstance is the instance data for this HID device.
// \param psUSBRequest points to the request received.
//
// This call parses the provided request structure.  Assuming the request is
// understood, it is handled and any required response generated.  If the
// request cannot be handled by this device class, endpoint zero is stalled to
// indicate an error to the host.
//
//*****************************************************************************
static void onRequest(void *userData, tUSBRequest *psUSBRequest)
{
        printf ("onRequest bmRequestType:%x, bRequest:%x, wValue:%x, wIndex:%x, wLength:%x\r\n",
                psUSBRequest->bmRequestType,
                psUSBRequest->bRequest,
                psUSBRequest->wValue,
                psUSBRequest->wIndex,
                psUSBRequest->wLength);

    CallbackDTO *callbackDTO = (CallbackDTO *) userData;

    ASSERT(callbackDTO);

    //
    // Determine the type of request.
    //
    switch(psUSBRequest->bRequest)
    {
        //
        // A Get Report request is used by the host to poll a device for its
        // current state.
        // The only required request.
        case USBREQ_GET_REPORT:
        {
                printf ("set get report");
            //
            // Need to ACK the data on end point 0 in this case.
            //
            USBDevEndpointDataAck(USB0_BASE, USB_EP_0, true);

            //
            // ..then send back the requested report.
            //

            callbackDTO->requestPending = true;

            if (psUSBRequest->wIndex == 1) {
                USBDCDSendDataEP0 (0, callbackDTO->report1, REPORT1_SIZE);
            }
            if (psUSBRequest->wIndex == 2) {
                USBDCDSendDataEP0 (0, callbackDTO->report2, REPORT2_SIZE);
            }

            break;
        }

        //
        // This request was not recognized so stall.
        //
        default:
        {
            USBDCDStallEP0(0);
            break;
        }
    }
}

/*##########################################################################*/



static tDeviceInfo deviceInfo;







///**
// * My initialization routine.
// */
//void *lowLevelHIDInit (uint32_t ui32Index, tUSBDHIDDevice *psHIDDevice, CallbackDTO *callbackDTO)
//{
//        tConfigDescriptor * pConfigDesc;
//
//        uint32_t ui32Loop;
//
//        // Initialize the various fields in our instance structure.
//        callbackDTO->ui8USBConfigured = 0;
//        callbackDTO->ui8Protocol = USB_HID_PROTOCOL_REPORT;
//        callbackDTO->sReportIdle.ui8Duration4mS = 125;
//        callbackDTO->sReportIdle.ui8ReportID = 0;
//        callbackDTO->sReportIdle.ui32TimeSinceReportmS = 0;
//        callbackDTO->sReportIdle.ui16TimeTillNextmS = 0;
//        callbackDTO->ui8LEDStates = 0;
//        callbackDTO->ui8KeyCount = 0;
//        callbackDTO->eKeyboardState = HID_KEYBOARD_STATE_UNCONFIGURED;
//        callbackDTO->psHIDDevice = psHIDDevice;
//
//        for(ui32Loop = 0; ui32Loop < KEYB_MAX_CHARS_PER_REPORT; ui32Loop++)
//        {
//                callbackDTO->pui8KeysPressed[ui32Loop] = HID_KEYB_USAGE_RESERVED;
//        }
//
//
//        psHIDDevice->ppsConfigDescriptor = g_ppsHIDConfigDescriptors;
//
//        void *pvRetcode = USBDHIDCompositeInit (ui32Index, psHIDDevice, 0);
//
//        pConfigDesc = (tConfigDescriptor *) g_pui8KeybDescriptor;
//        pConfigDesc->bmAttributes = psHIDDevice->ui8PwrAttributes;
//        pConfigDesc->bMaxPower = (uint8_t) (psHIDDevice->ui16MaxPowermA / 2);
//
//        //
//        // If we initialized the HID layer successfully, pass our device pointer
//        // back as the return code, otherwise return NULL to indicate an error.
//        //
//        if (pvRetcode) {
//                //
//                // Initialize the lower layer HID driver and pass it the various
//                // structures and descriptors necessary to declare that we are a
//                // keyboard.
//                //
//                pvRetcode = USBDHIDInit (ui32Index, psHIDDevice);
//
//                return ((void *) psHIDDevice);
//        }
//        else {
//                return ((void *) 0);
//        }
//}

void
UARTStdioConfig(uint32_t ui32PortNum, uint32_t ui32Baud, uint32_t ui32SrcClock)
{
    //
    // Check the arguments.
    //
    ASSERT((ui32PortNum == 0) || (ui32PortNum == 1) ||
           (ui32PortNum == 2));

    //
    // Check to make sure the UART peripheral is present.
    //
    if(!SysCtlPeripheralPresent(SYSCTL_PERIPH_UART0))
    {
        return;
    }

    //
    // Enable the UART peripheral for use.
    //
    SysCtlPeripheralEnable(SYSCTL_PERIPH_UART0);

    //
    // Configure the UART for 115200, n, 8, 1
    //
    UARTConfigSetExpClk(UART0_BASE, ui32SrcClock, ui32Baud,
                            (UART_CONFIG_PAR_NONE | UART_CONFIG_STOP_ONE |
                             UART_CONFIG_WLEN_8));

    //
    // Enable the UART operation.
    //
    UARTEnable(UART0_BASE);
}

void
ConfigureUART(void)
{
    //
    // Enable the GPIO Peripheral used by the UART.
    //
    SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOA);

    //
    // Enable UART0
    //
    SysCtlPeripheralEnable(SYSCTL_PERIPH_UART0);

    //
    // Configure GPIO Pins for UART mode.
    //
    GPIOPinConfigure(GPIO_PA0_U0RX);
    GPIOPinConfigure(GPIO_PA1_U0TX);
    GPIOPinTypeUART(GPIO_PORTA_BASE, GPIO_PIN_0 | GPIO_PIN_1);

    //
    // Use the internal 16MHz oscillator as the UART clock source.
    //
    UARTClockSourceSet(UART0_BASE, UART_CLOCK_PIOSC);

    //
    // Initialize the UART for console I/O.
    //
    UARTStdioConfig(0, 115200, 16000000);
}


/**
 *
 */
int main (void)
{
        SysCtlClockSet (SYSCTL_SYSDIV_4 | SYSCTL_USE_PLL | SYSCTL_OSC_MAIN | SYSCTL_XTAL_16MHZ);

        ConfigureUART ();
        printf ("tm4c123-drama-button starts\r\n");

        // Enable the GPIO port that is used for the on-board LED.
        SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOF);
        GPIOPinTypeGPIOOutput(GPIO_PORTF_BASE, GPIO_PIN_1 | GPIO_PIN_2 | GPIO_PIN_3);


        // USB config : Enable the GPIO peripheral used for USB, and configure the USB pins.
        SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOD);
        SysCtlGPIOAHBEnable(SYSCTL_PERIPH_GPIOD);
        GPIOPinTypeUSBAnalog(GPIO_PORTD_AHB_BASE, GPIO_PIN_4 | GPIO_PIN_5);

        ButtonsInit();
        RGBInit(0);

