ubiubiubi/iwasz-sandbox/tm4c123-drama-button-v2/src/main.c
        /****************************************************************************/

        CallbackDTO callbackDTO;
        callbackDTO.deviceInfo = &deviceInfo;
        callbackDTO.requestPending = false;

        deviceInfo.psCallbacks = &handlers; //???
        deviceInfo.pui8DeviceDescriptor = deviceDescriptor;
        deviceInfo.ppsConfigDescriptors = configHeaders;
        deviceInfo.ppui8StringDescriptors = stringDescriptors;
        deviceInfo.ui32NumStringDescriptors = NUM_STRING_DESCRIPTORS;
        USBDCDDeviceInfoInit (0, &deviceInfo);
//        InternalUSBTickInit();

        USBStackModeSet(0, eUSBModeForceDevice, 0);
        USBDCDInit (0, &deviceInfo, &callbackDTO);
//        GPIOPinWrite (GPIO_PORTF_BASE, GPIO_PIN_2, GPIO_PIN_2);

        uint32_t ui32Loop;
        uint8_t ui8ButtonsChanged, ui8Buttons;
        uint32_t color1[3] = { 0xffffu, 0x0000u, 0x0000u };
        uint32_t color2[3] = { 0x0000u, 0xffffu, 0x0000u };
        while (1) {
                ButtonsPoll(&ui8ButtonsChanged, &ui8Buttons);


//                if(ui8Buttons & RIGHT_BUTTON)
//                {
//                        RGBSet (color2, 0.01);
//                        RGBEnable();
//                }
//                else {
//                        RGBDisable ();
//                }

                if (ui8ButtonsChanged) {


                        // TODO obdługa zupełnie inaczej.
                        if(ui8Buttons & LEFT_BUTTON)
                        {
                                RGBSet(color1, 0.01);
                                RGBEnable();
//                                callbackDTO.pui8Report[0] = 0x00;
//                                callbackDTO.pui8Report[1] = 0x00;
//                                callbackDTO.pui8Report[2] = 0x04;

                                callbackDTO.report2[0] = 0x10;
                        }
                        else {
                                RGBDisable ();
                                for (int i = 0; i < REPORT1_SIZE; ++i) {
                                        callbackDTO.report1[i] = 0x00;
                                }

                                for (int i = 0; i < REPORT2_SIZE; ++i) {
                                        callbackDTO.report2[i] = 0x00;
                                }
                        }


                        if (USBDHIDTxPacketAvailable(device)) {
                                // Send the report to the host.
                                callbackDTO.eKeyboardState = HID_KEYBOARD_STATE_SEND;

                                uint32_t ui32Count = USBDHIDReportWrite(device, callbackDTO.pui8Report, KEYB_IN_REPORT_SIZE, true);

                                if (ui32Count != 0) {
                                        callbackDTO.bChangeMade = false;
                                }
                        }
                        else
                        {
                            // We can't send the report immediately so mark the instance so that
                            // it is sent next time the transmitter is free.
                            callbackDTO.bChangeMade = true;
                        }
                }
}

